#+TITLE: TODO list for topologyd
#+TODO: TODO(t) PROJ(p) LOOP(r) STRT(s) WAIT(w) HOLD(h) IDEA(i) | DONE(d) KILL(k) [ ](T) [-](S) [?](W) | [X](D) | OKAY(o) YES(y) NO(n)

* TODO Handle "500 internal server error" if lldpcli can't be executed on the machine
#+begin_src shell :results output
curl -v localhost:9090/lldp/chassis 2>&1 | tr -d \\r
#+end_src

#+RESULTS:
#+begin_example
,*   Trying 127.0.0.1:9090...
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0* Connected to localhost (127.0.0.1) port 9090 (#0)
> GET /lldp/chassis HTTP/1.1
> Host: localhost:9090
> User-Agent: curl/7.83.1
> Accept: */*
>
,* Mark bundle as not supporting multiuse
< HTTP/1.1 500 Internal Server Error
< Date: Thu, 10 Nov 2022 20:27:49 GMT
< Content-Length: 0
<
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
,* Connection #0 to host localhost left intact
#+end_example
